The collection of analytical surfaces.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public IList<EnergyAnalysisSurface> GetAnalyticalSurfaces()
  Visual Basic
Public Function GetAnalyticalSurfaces As IList(Of EnergyAnalysisSurface)
  Visual C++
public:
IList<EnergyAnalysisSurface^>^ GetAnalyticalSurfaces()
 Return Value
 Returns the analytical surfaces after model calculation.
 See Also
  EnergyAnalysisDetailModel Class
  Autodesk.Revit.DB.Analysis Namespace